'''Задача 5. Яйца
В рамках программы колонизации Марса компания «Спейс Инжиниринг»
вывела особую породу черепах, которые, по задумке, должны размножаться,
откладывая яйца в марсианском грунте. Откладывать яйца слишком близко к
поверхности опасно из-за радиации, а слишком глубоко — из-за давления
грунта и недостатка кислорода. Вообще, факторов очень много, но
специалисты проделали большую работу и предположили, что уровень
опасности для черепашьих яиц рассчитывается по формуле: D = x^3 − 3x^2 −
12x + 10, где x — глубина кладки в метрах, а D — уровень опасности в
условных единицах. Для тестирования гипотезы нужно взять пробу грунта на
безопасной, согласно формуле, глубине.
Напишите программу, находящую такое значение глубины х, при котором
уровень опасности как можно более близок к нулю. На вход программе
подаётся максимально допустимое отклонение уровня опасности от нуля, а
программа должна рассчитать приблизительное значение х, удовлетворяющее
этому отклонению. Известно, что глубина точно больше нуля и меньше четырёх
метров. Обеспечьте контроль ввода.
Пример:
Введите максимально допустимый уровень опасности: 0.01
Приблизительная глубина безопасной кладки: 0.732421875 м
'''

# CONST = 0.732421875
#
#
# def calc_danger(x):
#     return x ** 3 - 3 * x ** 2 - 12 * x + 10
#
#
#
#
# print(min_danger(0, 1, 0.1))

# d = x ** 3 - 3 * x ** 2 - 12 * x + 10
# print(d)
# for x in range(4):
#     for j in range(10):
#         x = x + 1 / 10
#         d = x ** 3 - 3 * x ** 2 - 12 * x + 10
#         print(f'{x} \t {d: >25}')


def calculate_danger(x):
    """Функция для расчета уровня опасности по формуле."""
    return x ** 3 - 3 * x ** 2 - 12 * x + 10


def find_safe_depth(max_danger):
    """Функция для нахождения глубины, при которой уровень опасности близок к нулю."""
    d_min = 0
    d_max = 4
    d_middle = (d_min + d_max) / 2
    middle_danger = calculate_danger(d_middle)
    while abs(middle_danger) > max_danger:
        if middle_danger > 0:
            d_min = d_middle
        else:
            d_max = d_middle
            d_middle = (d_min + d_max) / 2
            middle_danger = calculate_danger(d_middle)
    return d_middle


def main():
    """Основная функция для управления программой и ввода данных."""
    max_danger = float(input('Введите допустимый уровень опасности: '))
    if max_danger < 0:
        print('Вы ввели недопустимое значение! Попробуйте еще раз.')
    else:
        safe_depth = find_safe_depth(max_danger)
        print(f'Приблизительная глубина безопасной кладки:  {safe_depth: .9f} м ')
main()